In [2]:
import pandas as pd
df=pd.read_csv(r"C:\Users\ponna\OneDrive\Desktop\data1.csv")
df

        city  humidity  temp
0      Delhi      48.0  36.5
1     Mumbai      72.0  30.2
2    Chennai      65.0  33.8
3  Bangalore      81.0  28.4
4  Hyderabad      55.0  34.1
5    Kolkata      69.0  31.7
6       Pune      60.0  29.9
7  Ahmedabad      42.0  38.3
8     Jaipur      38.0  39.0
9    Lucknow      50.0  35.6

In [3]:
df.isnull()

    city  humidity   temp
0  False     False  False
1  False     False  False
2  False     False  False
3  False     False  False
4  False     False  False
5  False     False  False
6  False     False  False
7  False     False  False
8  False     False  False
9  False     False  False

## Exploring Data

In [4]:
df.head()

        city  humidity  temp
0      Delhi      48.0  36.5
1     Mumbai      72.0  30.2
2    Chennai      65.0  33.8
3  Bangalore      81.0  28.4
4  Hyderabad      55.0  34.1

In [5]:
df.tail()

        city  humidity  temp
5    Kolkata      69.0  31.7
6       Pune      60.0  29.9
7  Ahmedabad      42.0  38.3
8     Jaipur      38.0  39.0
9    Lucknow      50.0  35.6

In [6]:
df.head(3)

      city  humidity  temp
0    Delhi      48.0  36.5
1   Mumbai      72.0  30.2
2  Chennai      65.0  33.8

In [7]:
df.tail(3)

        city  humidity  temp
7  Ahmedabad      42.0  38.3
8     Jaipur      38.0  39.0
9    Lucknow      50.0  35.6

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   city      10 non-null     object
 1   humidity  10 non-null     float64
 2   temp      10 non-null     float64
dtypes: float64(2), object(1)
memory usage: 372.0+ bytes

In [9]:
df.describe()

        humidity       temp
count  10.000000  10.000000
mean   58.000000  33.750000
std    13.856406   3.645774
min    38.000000  28.400000
25%    48.500000  30.575000
50%    57.500000  33.950000
75%    68.000000  36.275000
max    81.000000  39.000000

In [10]:
df.columns

Index(['city', 'humidity', 'temp'], dtype='object')

In [11]:
df.shape

(10, 3)

In [12]:
df['temp']=df['temp'].fillna(df['temp'].mean())
df

        city  humidity  temp
0      Delhi      48.0  36.5
1     Mumbai      72.0  30.2
2    Chennai      65.0  33.8
3  Bangalore      81.0  28.4
4  Hyderabad      55.0  34.1
5    Kolkata      69.0  31.7
6       Pune      60.0  29.9
7  Ahmedabad      42.0  38.3
8     Jaipur      38.0  39.0
9    Lucknow      50.0  35.6

In [13]:
df['humidity']=df['humidity'].fillna(df['humidity'].sum())
df

        city  humidity  temp
0      Delhi      48.0  36.5
1     Mumbai      72.0  30.2
2    Chennai      65.0  33.8
3  Bangalore      81.0  28.4
4  Hyderabad      55.0  34.1
5    Kolkata      69.0  31.7
6       Pune      60.0  29.9
7  Ahmedabad      42.0  38.3
8     Jaipur      38.0  39.0
9    Lucknow      50.0  35.6

In [14]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [15]:
df.dtypes

city         object
humidity    float64
temp        float64
dtype: object

In [16]:
df.city

0        Delhi
1       Mumbai
2      Chennai
3    Bangalore
4    Hyderabad
5      Kolkata
6         Pune
7    Ahmedabad
8       Jaipur
9      Lucknow
Name: city, dtype: object

In [17]:
df.humidity

0    48.0
1    72.0
2    65.0
3    81.0
4    55.0
5    69.0
6    60.0
7    42.0
8    38.0
9    50.0
Name: humidity, dtype: float64

In [18]:
df[['city','humidity']]

        city  humidity
0      Delhi      48.0
1     Mumbai      72.0
2    Chennai      65.0
3  Bangalore      81.0
4  Hyderabad      55.0
5    Kolkata      69.0
6       Pune      60.0
7  Ahmedabad      42.0
8     Jaipur      38.0
9    Lucknow      50.0

In [19]:
df[2:5]

        city  humidity  temp
2    Chennai      65.0  33.8
3  Bangalore      81.0  28.4
4  Hyderabad      55.0  34.1

## Creating a database

In [22]:
data=pd.DataFrame({
    "Name":["madhu","bhargav","vamsi","meghana","dhanush","hari","vinay","rahul"],
    "Age": [12,23,45,67,23,23,12,23]
})
data

      Name  Age
0    madhu   12
1  bhargav   23
2    vamsi   45
3  meghana   67
4  dhanush   23
5     hari   23
6    vinay   12
7    rahul   23

In [23]:
data.head()

      Name  Age
0    madhu   12
1  bhargav   23
2    vamsi   45
3  meghana   67
4  dhanush   23

In [24]:
data.tail()

      Name  Age
3  meghana   67
4  dhanush   23
5     hari   23
6    vinay   12
7    rahul   23

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
dtypes: int64(1), object(1)
memory usage: 260.0+ bytes

In [27]:
data.describe()

             Age
count   8.000000
mean   28.500000
std    18.593394
min    12.000000
25%    20.250000
50%    23.000000
75%    28.500000
max    67.000000

In [28]:
data.shape

(8, 2)

In [29]:
data.columns

Index(['Name', 'Age'], dtype='object')

In [30]:
data.dtypes

Name    object
Age      int64
dtype: object

In [31]:
data.index

RangeIndex(start=0, stop=8, step=1)

In [33]:
data.isnull()

    Name    Age
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5  False  False
6  False  False
7  False  False